/*****************************************************************************
 *
 * Copyright (C) 2008-2010 Atmel Corporation
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * * Redistributions of source code must retain the above copyright
 *   notice, this list of conditions and the following disclaimer.
 *
 * * Redistributions in binary form must reproduce the above copyright
 *   notice, this list of conditions and the following disclaimer in
 *   the documentation and/or other materials provided with the
 *   distribution.
 *
 * * Neither the name of the copyright holders nor the names of
 *   contributors may be used to endorse or promote products derived
 *   from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN

#define AVR32_AES_START_SIZE                                        1
#define AVR32_AES_SWRST                                             8
#define AVR32_AES_SWRST_MASK                               0x00000100
#define AVR32_AES_SWRST_OFFSET                                      8
#define AVR32_AES_SWRST_SIZE                                        1
#define AVR32_AES_TXBUFE                                            4
#define AVR32_AES_TXBUFE_MASK                              0x00000010
#define AVR32_AES_TXBUFE_OFFSET                                     4
#define AVR32_AES_TXBUFE_SIZE                                       1
#define AVR32_AES_URAD                                              8
#define AVR32_AES_URAD_MASK                                0x00000100
#define AVR32_AES_URAD_OFFSET                                       8
#define AVR32_AES_URAD_SIZE                                         1
#define AVR32_AES_URAT                                             12
#define AVR32_AES_URAT_MASK                                0x0000f000
#define AVR32_AES_URAT_OFFSET                                      12
#define AVR32_AES_URAT_R_ODATAXR_DATA_PROC                 0x00000001
#define AVR32_AES_URAT_R_ODATAXR_SUBKEYS_GEN               0x00000003
#define AVR32_AES_URAT_R_WO_REG                            0x00000005
#define AVR32_AES_URAT_SIZE                                         4
#define AVR32_AES_URAT_W_IDATAXR_DATA_PROC_PDC             0x00000000
#define AVR32_AES_URAT_W_MR_DATA_PROC                      0x00000002
#define AVR32_AES_URAT_W_MR_SUBKEYS_GEN                    0x00000004
#define AVR32_AES_VALUE                                    0x0000000e
#define AVR32_AES_VARIANT                                          16
#define AVR32_AES_VARIANT_MASK                             0x00070000
#define AVR32_AES_VARIANT_OFFSET                                   16
#define AVR32_AES_VARIANT_SIZE                                      3
#define AVR32_AES_VERSION                                  0x000000fc
#define AVR32_AES_VERSION_MASK                             0x00000fff
#define AVR32_AES_VERSION_OFFSET                                    0
#define AVR32_AES_VERSION_SIZE                                     12
#define AVR32_AES_VERSION_VARIANT                                  16
#define AVR32_AES_VERSION_VARIANT_MASK                     0x00070000
#define AVR32_AES_VERSION_VARIANT_OFFSET                           16
#define AVR32_AES_VERSION_VARIANT_SIZE                              3
#define AVR32_AES_VERSION_VERSION                                   0
#define AVR32_AES_VERSION_VERSION_MASK                     0x00000fff
#define AVR32_AES_VERSION_VERSION_OFFSET                            0
#define AVR32_AES_VERSION_VERSION_SIZE                             12
#define AVR32_AES_W_IDATAXR_DATA_PROC_PDC                  0x00000000
#define AVR32_AES_W_MR_DATA_PROC                           0x00000002
#define AVR32_AES_W_MR_SUBKEYS_GEN                         0x00000004




#ifdef __AVR32_ABI_COMPILER__


typedef struct avr32_aes_cr_t {
    unsigned int                 :15;
    unsigned int loadseed        : 1;
    unsigned int                 : 7;
    unsigned int swrst           : 1;
    unsigned int                 : 7;
    unsigned int start           : 1;
} avr32_aes_cr_t;



typedef struct avr32_aes_mr_t {
    unsigned int                 : 3;
    unsigned int ctype           : 5;
    unsigned int ckey            : 4;
    unsigned int                 : 1;
    unsigned int cfbs            : 3;
    unsigned int lod             : 1;
    unsigned int opmod           : 3;
    unsigned int keysize         : 2;
    unsigned int smod            : 2;
    unsigned int procdly         : 4;
    unsigned int                 : 3;
    unsigned int cipher          : 1;
} avr32_aes_mr_t;



typedef struct avr32_aes_ier_t {
    unsigned int                 :23;
    unsigned int urad            : 1;
    unsigned int                 : 3;
    unsigned int txbufe          : 1;
    unsigned int rxbuff          : 1;
    unsigned int endtx           : 1;
    unsigned int endrx           : 1;
    unsigned int datrdy          : 1;
} avr32_aes_ier_t;



typedef struct avr32_aes_idr_t {
    unsigned int                 :23;
    unsigned int urad            : 1;
    unsigned int                 : 3;
    unsigned int txbufe          : 1;
    unsigned int rxbuff          : 1;
    unsigned int endtx           : 1;
    unsigned int endrx           : 1;
    unsigned int datrdy          : 1;
} avr32_aes_idr_t;



typedef struct avr32_aes_imr_t {
    unsigned int                 :23;
    unsigned int urad            : 1;
    unsigned int                 : 3;
    unsigned int txbufe          : 1;
    unsigned int rxbuff          : 1;
    unsigned int endtx           : 1;
    unsigned int endrx           : 1;
    unsigned int datrdy          : 1;
} avr32_aes_imr_t;



typedef struct avr32_aes_isr_t {
    unsigned int                 :16;
    unsigned int urat            : 4;
    unsigned int                 : 3;
    unsigned int urad            : 1;
    unsigned int                 : 3;
    unsigned int txbufe          : 1;
    unsigned int rxbuff          : 1;
    unsigned int endtx           : 1;
    unsigned int endrx           : 1;
    unsigned int datrdy          : 1;
} avr32_aes_isr_t;



typedef struct avr32_aes_version_t {
    unsigned int                 :13;
    unsigned int variant         : 3;
    unsigned int                 : 4;
    unsigned int version         :12;
} avr32_aes_version_t;



typedef struct avr32_aes_t {
  union {
          unsigned long                  cr        ;//0x0000
          avr32_aes_cr_t                 CR        ;
  };
  union {
          unsigned long                  mr        ;//0x0004
          avr32_aes_mr_t                 MR        ;
  };
          unsigned int                   :32       ;//0x0008
          unsigned int                   :32       ;//0x000c
  union {
          unsigned long                  ier       ;//0x0010
          avr32_aes_ier_t                IER       ;
  };
  union {
          unsigned long                  idr       ;//0x0014
          avr32_aes_idr_t                IDR       ;
  };
  union {
    const unsigned long                  imr       ;//0x0018
    const avr32_aes_imr_t                IMR       ;
  };
  union {
    const unsigned long                  isr       ;//0x001c
    const avr32_aes_isr_t                ISR       ;
  };
          unsigned long                  keyw1r    ;//0x0020
          unsigned long                  keyw2r    ;//0x0024
          unsigned long                  keyw3r    ;//0x0028
          unsigned long                  keyw4r    ;//0x002c
          unsigned long                  keyw5r    ;//0x0030
          unsigned long                  keyw6r    ;//0x0034
          unsigned long                  keyw7r    ;//0x0038
          unsigned long                  keyw8r    ;//0x003c
          unsigned long                  idata1r   ;//0x0040
          unsigned long                  idata2r   ;//0x0044
          unsigned long                  idata3r   ;//0x0048
          unsigned long                  idata4r   ;//0x004c
    const unsigned long                  odata1r   ;//0x0050
    const unsigned long                  odata2r   ;//0x0054
    const unsigned long                  odata3r   ;//0x0058
    const unsigned long                  odata4r   ;//0x005c
          unsigned long                  iv1r      ;//0x0060
          unsigned long                  iv2r      ;//0x0064
          unsigned long                  iv3r      ;//0x0068
          unsigned long                  iv4r      ;//0x006c
          unsigned int                   :32       ;//0x0070
          unsigned int                   :32       ;//0x0074
          unsigned int                   :32       ;//0x0078
          unsigned int                   :32       ;//0x007c
          unsigned int                   :32       ;//0x0080
          unsigned int                   :32       ;//0x0084
          unsigned int                   :32       ;//0x0088
          unsigned int                   :32       ;//0x008c
          unsigned int                   :32       ;//0x0090
          unsigned int                   :32       ;//0x0094
          unsigned int                   :32       ;//0x0098
          unsigned int                   :32       ;//0x009c
          unsigned int                   :32       ;//0x00a0
          unsigned int                   :32       ;//0x00a4
          unsigned int                   :32       ;//0x00a8
          unsigned int                   :32       ;//0x00ac
          unsigned int                   :32       ;//0x00b0
          unsigned int                   :32       ;//0x00b4
          unsigned int                   :32       ;//0x00b8
          unsigned int                   :32       ;//0x00bc
          unsigned int                   :32       ;//0x00c0
          unsigned int                   :32       ;//0x00c4
          unsigned int                   :32       ;//0x00c8
          unsigned int                   :32       ;//0x00cc
          unsigned int                   :32       ;//0x00d0
          unsigned int                   :32       ;//0x00d4
          unsigned int                   :32       ;//0x00d8
          unsigned int                   :32       ;//0x00dc
          unsigned int                   :32       ;//0x00e0
          unsigned int                   :32       ;//0x00e4
          unsigned int                   :32       ;//0x00e8
          unsigned int                   :32       ;//0x00ec
          unsigned int                   :32       ;//0x00f0
          unsigned int                   :32       ;//0x00f4
          unsigned int                   :32       ;//0x00f8
  union {
    const unsigned long                  version   ;//0x00fc
    const avr32_aes_version_t            VERSION   ;
  };
} avr32_aes_t;



/*#ifdef __AVR32_ABI_COMPILER__*/
#endif

/*#ifdef AVR32_AES_1231_H_INCLUDED*/
#endif

